{"class_name": "Model", "keras_version": "1.2.1", "config": {"name": "model_1", "output_layers": [["dense_4", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"input_dtype": "float32", "batch_input_shape": [null, 40, 160, 3], "name": "input_1", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_1", "class_name": "Convolution2D", "config": {"W_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "border_mode": "same", "nb_filter": 3, "subsample": [1, 1], "name": "convolution2d_1", "b_regularizer": null, "trainable": true, "b_constraint": null, "nb_col": 1, "bias": true, "nb_row": 1}}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "maxpooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}}, {"inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "convolution2d_2", "class_name": "Convolution2D", "config": {"W_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "border_mode": "same", "nb_filter": 32, "subsample": [1, 1], "name": "convolution2d_2", "b_regularizer": null, "trainable": true, "b_constraint": null, "nb_col": 3, "bias": true, "nb_row": 3}}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "convolution2d_3", "class_name": "Convolution2D", "config": {"W_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "border_mode": "same", "nb_filter": 32, "subsample": [1, 1], "name": "convolution2d_3", "b_regularizer": null, "trainable": true, "b_constraint": null, "nb_col": 3, "bias": true, "nb_row": 3}}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "maxpooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}}, {"inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "name": "convolution2d_4", "class_name": "Convolution2D", "config": {"W_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "border_mode": "same", "nb_filter": 64, "subsample": [1, 1], "name": "convolution2d_4", "b_regularizer": null, "trainable": true, "b_constraint": null, "nb_col": 3, "bias": true, "nb_row": 3}}, {"inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "convolution2d_5", "class_name": "Convolution2D", "config": {"W_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "border_mode": "same", "nb_filter": 64, "subsample": [1, 1], "name": "convolution2d_5", "b_regularizer": null, "trainable": true, "b_constraint": null, "nb_col": 3, "bias": true, "nb_row": 3}}, {"inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "maxpooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}}, {"inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "name": "convolution2d_6", "class_name": "Convolution2D", "config": {"W_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "border_mode": "same", "nb_filter": 64, "subsample": [1, 1], "name": "convolution2d_6", "b_regularizer": null, "trainable": true, "b_constraint": null, "nb_col": 3, "bias": true, "nb_row": 3}}, {"inbound_nodes": [[["convolution2d_6", 0, 0]]], "name": "convolution2d_7", "class_name": "Convolution2D", "config": {"W_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "border_mode": "same", "nb_filter": 64, "subsample": [1, 1], "name": "convolution2d_7", "b_regularizer": null, "trainable": true, "b_constraint": null, "nb_col": 3, "bias": true, "nb_row": 3}}, {"inbound_nodes": [[["convolution2d_7", 0, 0]]], "name": "maxpooling2d_4", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}}, {"inbound_nodes": [[["maxpooling2d_4", 0, 0]]], "name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "name": "flatten_2", "class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"inbound_nodes": [[["dropout_3", 0, 0]]], "name": "flatten_3", "class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true}}, {"inbound_nodes": [[["flatten_1", 0, 0], ["flatten_2", 0, 0], ["flatten_3", 0, 0]]], "name": "merge_1", "class_name": "Merge", "config": {"name": "merge_1", "mode": "concat", "output_mask_type": "raw", "output_shape": null, "concat_axis": -1, "mode_type": "raw", "output_shape_type": "raw", "dot_axes": -1, "arguments": {}, "output_mask": null}}, {"inbound_nodes": [[["merge_1", 0, 0]]], "name": "dense_1", "class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "output_dim": 512, "name": "dense_1", "b_constraint": null, "input_dim": 20480, "trainable": true, "b_regularizer": null, "bias": true}}, {"inbound_nodes": [[["dense_1", 0, 0]]], "name": "dense_2", "class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "output_dim": 128, "name": "dense_2", "b_constraint": null, "input_dim": 512, "trainable": true, "b_regularizer": null, "bias": true}}, {"inbound_nodes": [[["dense_2", 0, 0]]], "name": "dense_3", "class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "output_dim": 16, "name": "dense_3", "b_constraint": null, "input_dim": 128, "trainable": true, "b_regularizer": null, "bias": true}}, {"inbound_nodes": [[["dense_3", 0, 0]]], "name": "dense_4", "class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "output_dim": 1, "name": "dense_4", "b_constraint": null, "input_dim": 16, "trainable": true, "b_regularizer": null, "bias": true}}], "input_layers": [["input_1", 0, 0]]}}